src/test/resources/__files/pull-response-ok.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
	<env:Header>
		<eb:Messaging xmlns:eb="http://docs.oasis-open.org/ebxml-msg/ebms/v3.0/ns/core/200704/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" env:mustUnderstand="true" wsu:Id="id-d4fe5538-51ee-4a02-976d-46fb33f05e35">
			<ns6:UserMessage xmlns:ns6="http://docs.oasis-open.org/ebxml-msg/ebms/v3.0/ns/core/200704/" xmlns:ns2="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns3="http://www.unece.org/cefact/namespaces/StandardBusinessDocumentHeader" xmlns:ns4="http://www.w3.org/2003/05/soap-envelope" xmlns:ns5="http://www.w3.org/2000/09/xmldsig#" xmlns:ns7="http://docs.oasis-open.org/ebxml-bp/ebbp-signals-2.0" xmlns:ns8="http://www.w3.org/1999/xlink" xmlns:ns9="http://begrep.difi.no/sdp/schema_v10" mpc="urn:normal">
				<ns6:MessageInfo>
					<ns6:Timestamp>2014-05-28T10:01:16.565+02:00</ns6:Timestamp>
					<ns6:MessageId>8ec7ba1c-cb6f-448d-b965-0446c822bd32</ns6:MessageId>
					<ns6:RefToMessageId>AS4-14641D8F10A-27248@9908:889640782</ns6:RefToMessageId>
				</ns6:MessageInfo>
				<ns6:PartyInfo>
					<ns6:From>
						<ns6:PartyId type="urn:oasis:names:tc:ebcore:partyid-type:iso6523:9908">9908:984661185</ns6:PartyId>
						<ns6:Role>urn:sdp:avsender</ns6:Role>
					</ns6:From>
					<ns6:To>
						<ns6:PartyId type="urn:oasis:names:tc:ebcore:partyid-type:iso6523:9908">9908:889640782</ns6:PartyId>
						<ns6:Role>urn:sdp:meldingsformidler</ns6:Role>
					</ns6:To>
				</ns6:PartyInfo>
				<ns6:CollaborationInfo>
					<ns6:AgreementRef>http://begrep.difi.no/SikkerDigitalPost/Meldingsutveksling/FormidleDigitalPostForsendelse</ns6:AgreementRef>
					<ns6:Service>SDP</ns6:Service>
					<ns6:Action>KvitteringsForespoersel</ns6:Action>
					<ns6:ConversationId>1</ns6:ConversationId>
				</ns6:CollaborationInfo>
				<ns6:PayloadInfo>
					<ns6:PartInfo/>
				</ns6:PayloadInfo>
			</ns6:UserMessage>
		</eb:Messaging>
	</env:Header>
	<env:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-5117079d-5400-43f0-81e5-f8b5c0997e37">
		<ns3:StandardBusinessDocument xmlns:ns3="http://www.unece.org/cefact/namespaces/StandardBusinessDocumentHeader" xmlns:ns2="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns4="http://www.w3.org/2003/05/soap-envelope" xmlns:ns5="http://www.w3.org/2000/09/xmldsig#" xmlns:ns6="http://docs.oasis-open.org/ebxml-msg/ebms/v3.0/ns/core/200704/" xmlns:ns7="http://docs.oasis-open.org/ebxml-bp/ebbp-signals-2.0" xmlns:ns8="http://www.w3.org/1999/xlink" xmlns:ns9="http://begrep.difi.no/sdp/schema_v10">
			<ns3:StandardBusinessDocumentHeader>
				<ns3:HeaderVersion>1.0</ns3:HeaderVersion>
				<ns3:Sender>
					<ns3:Identifier Authority="iso6523-actorid-upis">9908:984661185</ns3:Identifier>
				</ns3:Sender>
				<ns3:Receiver>
					<ns3:Identifier Authority="iso6523-actorid-upis">9908:889640782</ns3:Identifier>
				</ns3:Receiver>
				<ns3:DocumentIdentification>
					<ns3:Standard>urn:no:difi:sdp:1.0</ns3:Standard>
					<ns3:TypeVersion>1.0</ns3:TypeVersion>
					<ns3:InstanceIdentifier>e20d4a1d-9d9b-47ec-a5a8-2189f4483724</ns3:InstanceIdentifier>
					<ns3:Type>kvittering</ns3:Type>
					<ns3:CreationDateAndTime>2014-05-28T09:04:17.704+02:00</ns3:CreationDateAndTime>
				</ns3:DocumentIdentification>
				<ns3:BusinessScope>
					<ns3:Scope>
						<ns3:Type>SCHEMA_GUIDE</ns3:Type>
						<ns3:InstanceIdentifier>SikkerDigitalPost/1.0</ns3:InstanceIdentifier>
						<ns3:CorrelationInformation>
							<ns3:RequestingDocumentInstanceIdentifier>2014/014</ns3:RequestingDocumentInstanceIdentifier>
						</ns3:CorrelationInformation>
					</ns3:Scope>
				</ns3:BusinessScope>
			</ns3:StandardBusinessDocumentHeader>
			<ns9:kvittering>
				<ns9:tidspunkt>2014-05-28T09:04:17.704+02:00</ns9:tidspunkt>
				<ns9:levering/>
			</ns9:kvittering>
		</ns3:StandardBusinessDocument>
	</env:Body>
</env:Envelope>
